# CLAUDE

## 一、作业要求

本次作业需要完成实验实现、结果整理与分析，并提交完整材料。具体要求如下：

1. 按照以下要求完成实验，实验脚本放在 `scripts` 目录下，实验结果统一输出到 `results` 目录下;
2. 撰写实验报告，报告中应包含算法实现思路、实验过程、实验结果展示以及结果分析。报告及其相关文件放在 `report` 目录下；
3. 报告使用latex撰写，用pdflatexd构建成为pdf。报告使用简体中文撰写，应包含丰富的图表、统计数据、分析。
4. 把报告中需要用的图表拷贝到report/attachments下。

## 二、背景

在真实的视频传输场景中，网络带宽通常会随时间发生变化，并且具有较强的不稳定性。如果视频始终以最高码率进行传输，当网络带宽下降时，很容易造成视频播放卡顿；而如果始终采用较低码率传输，虽然可以降低卡顿风险，但会牺牲视频画质，同时也无法充分利用可用带宽资源。

自适应码率算法，即 Adaptive Bit-Rate，简称 ABR，旨在根据当前网络状况和客户端播放状态，为每个视频块动态选择合适的码率版本，从而提升用户体验质量，即 Quality of Experience，简称 QoE。一个理想的 ABR 算法通常需要在多个目标之间进行权衡，包括减少卡顿时间、提高平均视频质量、降低相邻视频块之间的质量波动等。现实中网络带宽的波动和不确定性，在实际视频传输过程中无法始终保持最高码率进行传输，否则当网络状况变差时将导致严重的卡顿现象，但如果始终以较低码率传输数据，则会导致视频质量较低且无法充分利用带宽资源。自适应码率（Adaptive Bit-Rate，ABR）算法通过决策不同视频块的码率大小以适应实际的网络环境，从而提升用户的体验质量（Quality of Experience，QoE），以达到尽量少的卡顿、高的视频质量以及小的视频质量波动（视频质量波动指的是两个相邻视频块的码率差异）等。现有的ABR算法主要分为三类：基于缓冲区的ABR算法、基于网络吞吐量的ABR算法、结合缓冲区状态与带宽信息的混合型 ABR 算法。

其中，基于缓冲区的 ABR 算法主要依据客户端当前缓冲区占用情况来决定下一个视频块的码率。经典的BBA（Buffer-Based Algorithm）采用双阈值机制进行视频码率调节。当缓冲区占用较低，处于 reservoir 区间时，为了降低缓冲耗尽和重新缓冲的风险，算法倾向于选择最低码率；当缓冲区占用较高，达到 upper reservoir 区间时，说明当前缓冲较为充足，算法通常会选择最高码率以提升播放质量；当缓冲区处于两者之间的 cushion 区间时，算法会根据缓冲区大小进行线性映射，逐步选择更高的码率。

基于网络吞吐量（Rate-Based, RB）的 ABR 算法则主要依赖对未来网络带宽的估计来选择视频码率。一个简单的实现方式是根据历史视频块的下载情况估计带宽，例如使用视频块大小除以下载时间得到历史吞吐量，并将若干历史吞吐量的平均值作为下一时刻的带宽预测值。随后，算法从可选码率集合中选择不超过预测带宽且最接近预测值的码率版本进行传输。

## 三、实验任务

1. 完成实验环境配置，并成功运行示例代码。从 test_traces 文件夹中选择至少 3 条网络带宽 trace 进行实验。针对每条 trace，需要绘制以下随时间变化的曲线：
    1. 网络带宽变化曲线；
    2. 缓冲区大小变化曲线；
    3. 视频码率选择变化曲线。

2. 对所选的网络带宽 trace 进行统计分析：
    1. 平均带宽；
    2. 最大带宽和最小带宽；
    3. 带宽标准差；
    4. 带宽变化幅度；
    5. 是否存在突发下降或剧烈波动。然后结合这些特征分析：哪类网络环境下 BBA 表现更好；哪类网络环境下 RB 更好；网络波动对卡顿、码率选择和 QoE 的影响。

3. 阅读并理解 bba.py 中 BBA 算法的实现逻辑。在实验中修改不同的 reservoir 和 cushion 参数组合，并分析不同参数设置对BBA算法决策的影响。
4. 分析QoE reward 公式的影响。要求阅读代码中的 reward 计算方式，分析 reward 由哪些部分组成，例如
    1. 视频质量奖励；
    2. 卡顿惩罚；
    3. 视频质量波动惩罚。然后修改不同的惩罚权重，观察算法表现是否发生变化。
5. 根据RB算法原理，实现一个基础版本的RB算法。将自己实现的 RB 算法与 BBA 算法进行对比实验。比较指标至少包括以下内容：
    1. 视频质量（视频码率）；
    2. 视频卡顿时间；
    3. 视频质量波动；
    4. 最终的QoE（reward）。
6. 结合实验结果，分析 BBA 算法和 RB 算法各自的优势与不足。

## 四、实验环境与运行说明

实验环境要求如下：

1. 使用 `conda` 虚拟环境；

```bash
conda activate CV
```

2. *运行BBA示例程序：

```bash
python bba.py
```

## 五、数据文件说明

1. 网络带宽trace文件在test_traces文件夹下，每行包含两个字段：时间戳（s）、网络带宽（Mbps）；其中，时间戳表示当前采样时间，网络带宽表示该时刻可用的网络传输速率。
2. 程序运行后，会在results文件下会生成对应的实验结果文件，结果中每行的数据分别为time_stamp、bit_rate、buffer_size、rebuffer_time、chunk_size、download_time、reward；
3. video_size文件夹中给出了6个码率版本下的视频块大小信息。本实验中的视频共包含49个chunk，每个chunk的视频时长为4s。

## 六、参考资料

[1].<https://github.com/hongzimao/pensieve/blob/master/test/bb.py>
[2].T.-Y. Huang, R. Johari, N. McKeown, M. Trunnell, and M. Watson,“A buffer-based approach to rate adaptation: Evidence from a large video streaming service,” in Proc. ACM Conf. SIGCOMM (SIGCOMM), Chicago, IL, USA, 2014, pp. 187–198. [Online]. Available: <https://doi.org/10.1145/2619239.2626296>
